OSHE-Github/Open-Source-Modular-Controller/Controller Code/Old Controller Codes/Controller code esp-idf/esp32s3_hid_gamepad_joystick/sdkconfig.defaults
#
# Default sdkconfig options for ESP32-S3 USB HID Gamepad with ADC joystick
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_DEVICE_ENABLED=y
CONFIG_TINYUSB_HID_ENABLED=y
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ADC_CONTINUOUS_DRIVER=y
CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE=y
